var chapter1 = {
	name : "第一章 雀食奇谭",
	ghost : [" 天邪鬼绿1  天邪鬼绿×1 灯笼鬼×2 （普通模式）", 
			" 天邪鬼绿2  天邪鬼绿×1 跳跳犬×2 （困难模式）", 
			" 天邪鬼绿3  天邪鬼绿×1 提灯小僧×2", 
			" 提灯小僧1  天邪鬼绿×2 提灯小僧×1", 
			" 提灯小僧2  天邪鬼绿×2 提灯小僧×1", 
			" 首领：九命猫  九命猫×3", 
			" 挑战：天邪鬼绿天邪鬼绿×14", 
			" 挑战：天邪鬼绿天邪鬼绿×14"],
}

var chapter2 = {
	name : "第二章 幸福的彼岸",
	ghost : [" 帚神：盗墓小鬼×1 寄生魂×1 帚神×1", 
			" 盗墓小鬼：盗墓小鬼×1 寄生魂×2", 
			" 盗墓小鬼：盗墓小鬼×1 灯笼鬼×2", 
			" 寄生魂：寄生魂×1 灯笼鬼×2", 
			" 寄生魂：盗墓小鬼×2 寄生魂×1", 
			" 首领：座敷童子 座敷童子×1 天邪鬼绿×2 天邪鬼青×1", 
			" 挑战：提灯小僧 提灯小僧×14", 
			" 挑战：座敷童子 座敷童子×14"]
}
var chapter3 = {
	name : "第三章 凤凰林的占卜师",
	ghost : [" 天邪鬼黄：天邪鬼黄×1 帚神×2 涂壁×1",
			" 天邪鬼黄：天邪鬼黄×1 童女×3",
			" 赤舌：赤舌×1 提灯小僧×1 灯笼鬼×2 ；二回合 - 鸦天狗×1",
			" 赤舌：赤舌×1 天邪鬼黄×1 童女×2；二回合 - 鸦天狗×1",
			" 兵俑：兵俑×1 提灯小僧×1 童女×2 （普通模式）",
			" 兵俑：兵俑×1 提灯小僧×1 灯笼鬼×2",
			" 首领：凤凰火 凤凰火×1 寄生魂×3",
			" 挑战：天邪鬼黄 天邪鬼黄×14",
			" 挑战：铁鼠 铁鼠×14",
			" 挑战：三尾狐 三尾狐×14"]
}
var chapter4 = {
	name : "第四章 桥上的雨女",
	ghost : [" 帚神1 帚神×1 涂壁×2",
			" 帚神2 帚神×1 涂壁x1 唐纸伞妖×2 （普通模式）",
			" 帚神2 帚神×1 唐纸伞妖×3 （困难模式）",
			" 唐纸伞妖1 唐纸伞妖×1 天邪鬼赤×3",
			" 唐纸伞妖2 唐纸伞妖×1 天邪鬼赤×1 涂壁×2 （普通模式）",
			" 唐纸伞妖2 唐纸伞妖×1 涂壁×3 （困难模式）",
			" 天邪鬼赤1 天邪鬼赤×1 唐纸伞妖×1 涂壁×2 （普通模式）",
			" 天邪鬼赤1 天邪鬼赤×1 涂壁×3 （困难模式）",
			" 天邪鬼赤2 天邪鬼赤×1 唐纸伞妖×2",
			" 首领：雨女 雨女×1 青蛙瓷器×1 帚神×2",
			" 挑战：雨女 雨女×14",
			" 挑战：青蛙瓷器 青蛙瓷器×14",
			" 挑战：管狐 管狐×14"]
}
var chapter5 = {
	name : "第五章 黑夜山的食发鬼",
	ghost : [" 涂壁1 涂壁×1 天邪鬼赤×2 黑豹×1 （普通模式）",
			" 涂壁1 涂壁×1 天邪鬼赤×2 （困难模式）",
			" 涂壁2 涂壁×1 天邪鬼赤×3",
			" 帚神1 帚神×1 天邪鬼赤×1 涂壁×2",
			" 帚神2 帚神×1 天邪鬼赤×1 天邪鬼黄×2",
			" 管狐1 管狐×2 天邪鬼黄×2；二回合 - 寄生魂×1",
			" 管狐2 管狐×1 天邪鬼绿×3；二回合 - 寄生魂×1",
			" 首领：食发鬼 食发鬼×1 灯笼鬼×1 天邪鬼青×2",
			" 挑战：帚神 帚神×14",
			" 挑战：食发鬼 食发鬼×14"]
}
var chapter6 = {
	name : "第六章 似梦非梦",
	ghost : [" 灯笼鬼 灯笼鬼×1 帚神×3",
			" 天邪鬼青 天邪鬼青×1 天邪鬼绿×3",
			" 蝴蝶精 蝴蝶精×1 涂壁×1 天邪鬼赤×2；二回合 - 三尾狐×1",
			" 首领：巫蛊师 巫蛊师×1 天邪鬼绿×3",
			" 挑战：灯笼鬼 灯笼鬼×14",
			" 挑战：巫蛊师 巫蛊师×14",
			" 挑战：蝴蝶精 蝴蝶精×14",]
			}
var chapter7 = {
	name : "第七章 恋上鲤的美",
	ghost :[" 鲤鱼精1 鲤鱼精×3 帚神×1",
			" 鲤鱼精2 鲤鱼精×1 帚神×3",
			" 河童1 河童×1 鲤鱼精×1 涂壁×2",
			" 河童2 河童×1 灯笼鬼×1 跳跳犬×2",
			" 提灯小僧1 提灯小僧×1 跳跳犬×3；二回合 - 管狐×1",
			" 提灯小僧2 提灯小僧×1 跳跳犬×3；二回合 - 管狐×1",
			" 提灯小僧3 提灯小僧×1 跳跳犬×1 鲤鱼精×2",
			" 提灯小僧3 提灯小僧×1 跳跳犬×1 鲤鱼精×2；二回合 - 管狐×1 （困难模式）",
			" 首领：妖狐 妖狐×1 涂壁×1 座敷童子×2；二回合 - 妖狐×1 寄生魂×1 天邪鬼赤×2",
			" 挑战：天邪鬼赤 天邪鬼赤×14",
			" 挑战：鲤鱼精 鲤鱼精×14",
			" 挑战：河童 河童×14",]
}
var chapter8 = {
	name : "第八章 樱与桃",
	ghost : [" 唐纸伞妖1 唐纸伞妖×1 帚神×3",
			" 唐纸伞妖2 唐纸伞妖×1 山童×1 帚神×2",
			" 樱花妖1 樱花妖×1 帚神×1 涂壁×2；二回合 - 雪女×1",
			" 樱花妖2 樱花妖×1 涂壁×3；二回合 - 雪女×1",
			" 天邪鬼绿 天邪鬼绿×1 天邪鬼青×1 天邪鬼黄×2",
			" 首领：桃花妖 樱花妖×1 天邪鬼青×1 提灯小僧×2；二回合 - 桃花妖×1 帚神×1 蝴蝶精×2",
			" 挑战：唐纸伞妖 唐纸伞妖×14",
			" 挑战：桃花妖 桃花妖×14"]
}
var chapter9 = {
	name : "第九章 兔蛙茶和锅",
	ghost :[" 提灯小僧1 提灯小僧×1 灯笼鬼×3",
			" 提灯小僧2 提灯小僧×1 灯笼鬼×1 铁鼠×2",
			" 铁鼠1 铁鼠×1 帚神×3",
			" 铁鼠2 铁鼠×2 帚神×2",
			" 山兔1 山兔×4；二回合 - 鸦天狗×1",
			" 山兔2 山兔×3 铁鼠×1；二回合 - 鸦天狗×1",
			" 首领：孟婆 孟婆×1 饿鬼×3；二回合 - 孟婆×1 灯笼鬼×1 鸦天狗×2",
			" 挑战：天邪鬼青 天邪鬼青×14",
			" 挑战：山兔 山兔×14"]
}
var chapter10 = {
	name : "第十章 鬼为谁买醉",
	ghost :[" 丑时之女 丑时之女×1 傀儡师×1 天邪鬼青×2",
			" 傀儡师1 傀儡师×1 觉×1 狸猫×2",
			" 傀儡师2 傀儡师×1 觉×1 座敷童子×2；二回合 - 犬神×1",
			" 觉1 觉×1 狸猫×3",
			" 觉2 觉×1 赤舌×1 座敷童子×2；二回合 - 犬神×1",
			" 首领：酒吞童子 酒吞童子×1 跳跳哥哥×1 食发鬼×2；二回合 - 酒吞童子×1 兵俑×1 骨女×2",
			" 挑战：武士之灵 武士之灵×14",
			" 挑战：丑时之女 丑时之女×14",]
}
var chapter11 = {
	name : "第十一章 染红了的枫叶林",
	ghost :[" 武士之灵1 武士之灵×1 寄生魂×3",
			" 武士之灵2 武士之灵×1 独眼小僧×3",
			" 独眼小僧1 独眼小僧×1 涂壁×1 天邪鬼赤×2 （简单模式）",
			" 独眼小僧1 独眼小僧×1 涂壁×1 天邪鬼赤×2；二回合 - 独眼小僧×1 （困难模式）",
			" 独眼小僧2 独眼小僧×1 管狐×1 天邪鬼赤×2 （简单模式）",
			" 独眼小僧2 独眼小僧×1 管狐×1 天邪鬼赤×2；二回合 - 独眼小僧×1 （困难模式）",
			" 饿鬼1 饿鬼×1 涂壁×1 管狐×2",
			" 饿鬼2 饿鬼×3 管狐×1",
			" 首领：鬼女红叶 鬼女红叶×1 童女×1 天邪鬼青×2；二回合 - 鬼女红叶×1 骨女×1 觉×2",
			" 挑战：寄生魂 寄生魂×14",
			" 挑战：饿鬼 饿鬼×14"]
			}
var chapter12 = {
	name : "第十二章 另一个晴明",
	ghost :[" 海坊主1 海坊主×1 帚神×1 涂壁×2",
			" 海坊主2 海坊主×1 涂壁×1 鸦天狗×2",
			" 童男1 童男×1 天邪鬼黄×1 鸦天狗×2",
			" 童男2 童男×1 童女×1 鸦天狗×2",
			" 童女1 童女×1 盗墓小鬼×1 提灯小僧×2；二回合 - 雪女×1",
			" 童女2 童女×3 盗墓小鬼×1；二回合 - 雪女×1",
			" 首领：雪女 雪女×1 寄生魂×1 武士之灵×2；二回合 - 雪女×1 跳跳妹妹×1 跳跳哥哥×2",
			" 挑战：童男 童男×14",
			" 挑战：童女 童女×14"]
}
var chapter13 = {
	name : "第十三章 箭与弓道",
	ghost :[" 饿鬼1  饿鬼×1 天邪鬼赤×3",
			" 饿鬼2  饿鬼×1 天邪鬼赤×3",
			" 饿鬼3  饿鬼×1 天邪鬼赤×3；二回合 - 首无×1",
			" 唐纸伞妖1  唐纸伞妖×1 天邪鬼赤×1 天邪鬼绿×2",
			" 唐纸伞妖2  唐纸伞妖×1 天邪鬼赤×1 天邪鬼绿×2",
			" 唐纸伞妖3  唐纸伞妖×1 天邪鬼赤×1 天邪鬼绿×2；二回合 - 首无×1",
			" 首领：首无  首无×1 骨女×1 灯笼鬼×1 山兔×1",
			" 挑战：涂壁  涂壁×14",
			" 挑战：兵俑  兵俑×14"]
}
var chapter14 = {
	name : "第十四章 梦境的邂逅",
	ghost :[" 帚神1  帚神×1 天邪鬼赤×3",
			" 帚神2  帚神×1 天邪鬼赤×3",
			" 帚神3  帚神×1 天邪鬼赤×3",
			" 涂壁1  涂壁×6;",
			" 涂壁2  涂壁×6;",
			" 涂壁3  涂壁×6；二回合 - 食梦貘×1",
			" 首领：食梦貘  食梦貘×1 天邪鬼赤×3；二回合 - 食梦貘×4",
			" 挑战：盗墓小鬼  盗墓小鬼×14",
			" 挑战：狸猫  狸猫×14"]
}
var chapter15 = {
	name : "第十五章 阴界裂缝",
	ghost :[" 天邪鬼绿1  天邪鬼绿×1 赤舌×1 天邪鬼赤×2",
			" 天邪鬼绿2  天邪鬼绿×1 赤舌×1 天邪鬼赤×2",
			" 天邪鬼绿3  天邪鬼绿×1 赤舌×1 天邪鬼赤×2",
			" 提灯小僧1  提灯小僧×1 赤舌×1 九命猫×2",
			" 提灯小僧2  提灯小僧×1 赤舌×1 九命猫×2",
			" 提灯小僧3  提灯小僧×1 赤舌×1 九命猫×2；二回合 - 大天狗×1",
			" 首领：跳跳妹妹  跳跳妹妹×1 九命猫×3",
			" 挑战：跳跳弟弟  跳跳弟弟×14",
			" 挑战：跳跳妹妹  跳跳妹妹×14"]
}
var chapter16 = {
	name : "第十六章 冥界审判",
	ghost :[" 饿鬼1  饿鬼×1 山兔×1 山童×2",
			" 饿鬼2  饿鬼×1 山兔×1 山童×2",
			" 饿鬼3  饿鬼×1 山兔×1 山童×2",
			" 赤舌1  赤舌×1 寄生魂×3",
			" 赤舌2  赤舌×1 寄生魂×3；二回合 - 赤舌×1",
			" 赤舌3  赤舌×1 寄生魂×3",
			" 首领：判官  判官×1 鬼使黑×1 鬼使白×1",
			" 挑战：赤舌  赤舌×14",
			" 挑战：山童  山童×14"]
}
var chapter17 = {
	name : "第十七章 阴阳逆反",
	ghost :[" 鸦天狗1  鸦天狗×1 风小麒麟×3",
			" 鸦天狗2  鸦天狗×1 风小麒麟×3",
			" 鸦天狗3  鸦天狗×1 风小麒麟×3",
			" 狸猫1  狸猫×1 火小麒麟×3",
			" 狸猫2  狸猫×1 火小麒麟×3",
			" 狸猫3  狸猫×1 火小麒麟×3；二回合 - 黑凤凰×1",
			" 首领：荒川之主  荒川之主×1 灯笼鬼×1 骨女×1 山兔×1",
			" 挑战：萤草  萤草×14",
			" 挑战：鸦天狗  鸦天狗×14"]
}
var chapter18 = {
	name : "第十八章 阴阳之理",
	ghost :[" 九命猫1  九命猫×6",
			" 九命猫2  九命猫×6",
			" 九命猫3  九命猫×6",
			" 三尾狐1  三尾狐×2 九命猫×2；二回合 - 大天狗×1",
			" 三尾狐2  三尾狐×2 九命猫×2",
			" 三尾狐3  三尾狐×2 九命猫×2",
			" 首领：大天狗  大天狗×1 鸦天狗×3",
			" 挑战：独眼小僧  独眼小僧×14",
			" 挑战：觉  觉×14",
			" 挑战：镰鼬  镰鼬×14"]
}
var chapter19 = {
	name : "第十九章 八岐大蛇的复仇",
	ghost :[" 清姬1  二口女×1 络新妇×2 清姬×3",
			" 清姬2  清姬×1 二口女×3",
			" 络新妇1  络新妇×3 清姬×3",
			" 络新妇2  络新妇×2 清姬×2",
			" 二口女1  二口女×1 络新妇×3;二回合 - 络新妇×1",
			" 二口女2  二口女×4",
			" 二口女3  古笼火×1 络新妇×2 二口女×3",
			" 首领：八百比丘尼  二口女×1 清姬×2 孔雀×2 八百比丘尼×1"]
}
var chapter20 = {
	name : "第二十章 堵上性命的仪式",
	ghost :[" 般若1  二口女×1 般若×3",
			" 般若2  二口女×1 古笼火×3;二回合 - 凤凰火×1",
			" 般若3  二口女×1 古笼火×3 清姬×2",
			" 古笼火1  二口女×2 清姬×2",
			" 古笼火2  二口女×1 般若×4 清姬×1",
			" 清姬1  般若×3 络新妇×1",
			" 清姬2  古笼火×5 络新妇×1",
			" 首领：妖刀姬  二口女×1 般若×2 古笼火×2 妖刀姬×1"]
}
var chapter21 = {
	name : "第二十一章 七角山的秘闻",
	ghost : [" 烟烟罗1  烟烟罗×1 武士之灵×3",
			" 烟烟罗2  烟烟罗×1 武士之灵×2 兵俑×1",
			" 食发鬼1  丑时之女×3 食发鬼×1",
			" 食发鬼2  丑时之女×2 食发鬼×1 兵俑×1",
			" 食发鬼3  丑时之女×2 食发鬼×1 兵俑×1",
			" 吸血姬1  跳跳弟弟×3 吸血姬×1;二回合 - 夜叉×1",
			" 吸血姬2  跳跳弟弟×2 武士之灵×1;二回合 - 夜叉×1",
			" 首领：萤草 吸血姬×1 烟烟罗×2 萤草×1;二回合 - 夜叉×1 烟烟罗×2 萤草×1"]
}

//-------------------- 御魂 1~10层 --------------------------------------------------------------------
var yuhun1 = {
	name : "御魂副本  第一层",
	ghost : ["一回合 三尾狐×1 天邪鬼黄×1 天邪鬼青×1","二回合 山童×1 涂壁×1 独眼小僧×1","三回合 八歧大蛇×1 天邪鬼赤×2"]
}
var yuhun2 = {
	name : "御魂副本  第二层",
	ghost : ["一回合 妖狐×1 鲤鱼精×1 河童×1","二回合 吸血姬×1 萤草×1 兵俑×1","三回合 八歧大蛇×1 童女×2"]
}
var yuhun3 = {
	name : "御魂副本  第三层",
	ghost : ["一回合 桃花妖×1 蝴蝶精×1 青蛙瓷器×1","二回合 海坊主×1 鲤鱼精×1 椒图×1","三回合 八歧大蛇×1 座敷童子×2"]
}
var yuhun4 = {
	name : "御魂副本  第四层",
	ghost : ["一回合 犬神×1 童男×1 童女×1","二回合 大天狗×1 鬼使黑×1 鬼使白×1","三回合 八歧大蛇×1 食梦貘×2"]
}
var yuhun5 = {
	name : "御魂副本  第五层",
	ghost : ["一回合 镰鼬×1 骨女×1 丑时之女×1","二回合 傀儡师×1 跳跳哥哥×1 独眼小僧×1","三回合 八歧大蛇×1 孟婆×2"]
}
var yuhun6 = {
	name : "御魂副本  第六层",
	ghost : ["一回合 雨女×1 孟婆×1 座敷童子×1","二回合 阎魔×1 巫蛊师×1 鸦天狗×1","三回合 八歧大蛇×1 骨女×2"]
}
var yuhun7 = {
	name : "御魂副本  第七层",
	ghost : ["一回合 丑时之女×1 凤凰火×1 食发鬼×1","二回合 山兔×1 酒吞童子×1 妖琴师×1","三回合 八歧大蛇×1 荒川之主×2"]
}
var yuhun8 = {
	name : "御魂副本  第八层",
	ghost : ["一回合 管狐×1 判官×1 饿鬼×1","二回合 蝴蝶精×1 白狼×1 椒图×1","三回合 八歧大蛇×1 茨木童子×2"]
}
var yuhun9 = {
	name : "御魂副本  第九层",
	ghost : ["一回合 椒图×1 萤草×1 鲤鱼精×1","二回合 狸猫×1 清姬×1 食梦貘×1","三回合 八歧大蛇×1 两面佛×2"]
}
var yuhun10 = {
	name : "御魂副本  第十层",
	ghost : ["一回合 二口女×1 觉×1 萤草×1","二回合 椒图×1 青行灯×1 酒吞童子×1","三回合 八歧大蛇×1 大天狗×2"]
}


//----------- 妖气封印 ---------------------------------------------------------------------------------------------------
var ttggB = {
	name : "妖气封印  跳跳哥哥",
	ghost : ["一回合 天邪鬼绿×4","二回合 帚神×2 天邪鬼青×1 天邪鬼赤×1","三回合 跳跳哥哥×3 天邪鬼青×2 天邪鬼黄×1"]
}
var jtB = {
	name : "妖气封印  椒图",
	ghost : ["一回合 天邪鬼绿×3 天邪鬼黄×1","二回合 天邪鬼绿×3 天邪鬼赤×1","三回合 椒图×3 天邪鬼绿×2 天邪鬼黄×1"]
}

var gnB = {
	name : "妖气封印  骨女",
	ghost : ["一回合 帚神×4","二回合 天邪鬼赤×1 天邪鬼绿×3","三回合 骨女×3 天邪鬼绿×3"]
}

var egB = {
	name : "妖气封印  饿鬼",
	ghost : ["一回合 涂壁×1 天邪鬼绿×3","二回合 唐纸伞妖×1 天邪鬼绿×3","三回合 饿鬼×3 提灯小僧×3"]
}

var eknB = {
	name : "妖气封印  二口女",
	ghost : ["一回合 帚神×1 天邪鬼青×3","二回合 帚神×3 提灯小僧×1","三回合 二口女×1 提灯小僧×3"]
}

var hfzB = {
	name : "妖气封印  海坊主",
	ghost : ["一回合 提灯小僧×1 天邪鬼黄×3","二回合 天邪鬼青×1 天邪鬼绿×1 天邪鬼赤×2","三回合 海坊主×3 提灯小僧×3"]
}

var gshB = {
	name : "妖气封印  鬼使黑",
	ghost : ["一回合 天邪鬼赤×1 涂壁×3","二回合 帚神×3 涂壁×1","三回合 鬼使黑×3 提灯小僧×3"]
}

var tsB = {
	name : "妖气封印  金币妖怪",
	ghost : ["一回合 铁鼠×6","二回合 铁鼠×6","三回合 铁鼠×6"]
}

var jydmB = {
	name : "妖气封印  经验妖怪",
	ghost : ["一回合奉为达摩×4","二回合奉为达摩×6","三回合奉为达摩×6"]
}

var yyhB = {
	name : "业原火",
	ghost :["一回合 萤草×3 妖狐×1","二回合 三尾狐×1 椒图×1 萤草×1 蝴蝶精×1 兵佣×1","三回合 贪×1 嗔×1 痴×1"]
}

//---------------------------- 皮肤副本--------------
var gnhyPF = {
	name : "红叶的羁绊",
	ghost :["第一层 邂逅<br/> 一回合 管狐×4 <br/>二回合 饿鬼×4 <br/>三回合 鬼女红叶×1 觉×3 <br/>",
			"第二层 别离<br/> 一回合 管狐×4 <br/>二回合 饿鬼×4 三回合 鬼女红叶×1 跳跳妹妹×1 跳跳弟弟×1 跳跳哥哥×1 <br/>",
			"第三层 暮想<br/> 一回合 管狐×4 <br/>二回合 饿鬼×4 三回合 鬼女红叶×1 首无×2 三尾狐×1 <br/>",
			"第四层 唆摆<br/> 一回合 管狐×3 天邪鬼黄×1 <br/>二回合 饿鬼×3 兵俑×1 <br/>三回合鬼女红叶×1 鸦天狗×2 丑时之女×1 <br/>",
			"第五层 意乱<br/> 一回合 管狐×3 天邪鬼黄×1 <br/>二回合饿鬼×3 兵俑×1 <br/>三回合鬼女红叶×1 铁鼠×2 骨女×1 <br/>",
			"第六层 妖变<br/> 一回合 管狐×3 赤舌×1 <br/>二回合饿鬼×3 椒图×1 <br/>三回合鬼女红叶×1 雨女×2 雪女×1 <br/>",
			"第七层 堕落<br/> 一回合 管狐×3 赤舌×1 <br/>二回合 饿鬼×3 椒图×1 <br/>三回合鬼女红叶×1 吸血姬×2 狸猫×1 酒吞童子×1 <br/>",
			"第八层 痴迷<br/> 一回合 管狐×3 独眼小僧×1 <br/>二回合饿鬼×3 犬神×1 <br/>三回合鬼女红叶×1 兵俑×1 椒图×1 桃花妖×1 酒吞童子×1 <br/>",
			"第九层 苦恋<br/> 一回合 管狐×3 独眼小僧×1 <br/>二回合饿鬼×3 犬神×1 椒图×1 <br/>三回合鬼女红叶×1 酒吞童子×1 桃花妖×1 鸦天狗×1 椒图×1 丑时之女×1 <br/>",
			"第十层 羁绊<br/> 一回合 管狐×3 独眼小僧×1 <br/>二回合饿鬼×3 犬神×1 椒图×1 兵俑×1 <br/>三回合鬼女红叶×1 酒吞童子×1 桃花妖×1 般若×1 椒图×1 吸血姬×1 <br/>"]			
}
var yaodaoPF = {
	name : "妖刀的秘籍",
	ghost :["妖刀·一式 <br/>一回合天邪鬼青×4 <br/>二回合狸猫×4 <br/>三回合妖刀姬×1 盗墓小鬼×3 <br/>",
			"妖刀·二式 <br/>一回合天邪鬼青×4 <br/>二回合狸猫×4 <br/>三回合妖刀姬×1 蝴蝶精×3 <br/>",
			"妖刀·三式 <br/>一回合天邪鬼青×4 <br/>二回合狸猫×4三回合妖刀姬×1 雨女×3 <br/>",
			"妖刀·四式 <br/>一回合天邪鬼青×3 涂壁×1 <br/>二回合狸猫×3 蝴蝶精×1 <br/>三回合妖刀姬×1 三尾狐×3 <br/>",
			"妖刀·五式 <br/>一回合天邪鬼青×3 涂壁×1 <br/>二回合狸猫×3 蝴蝶精×1 <br/>三回合妖刀姬×1 傀儡师×1 二口女×1 骨女×1 <br/>",
			"妖刀·六式 <br/>一回合天邪鬼青×3 天邪鬼绿×1 <br/>二回合狸猫×3 鸦天狗×1 <br/>三回合妖刀姬×1 桃花妖×1 樱花妖×1 清姬×1 <br/>",
			"妖刀·七式 <br/>一回合天邪鬼青×3 天邪鬼绿×1 <br/>二回合狸猫×3 鸦天狗×1 <br/>三回合妖刀姬×1 鬼使黑×1 鬼使白×1 判官×1 <br/>",
			"妖刀·八式 <br/>一回合天邪鬼青×3 九命猫×1 <br/>二回合狸猫×3 鲤鱼精×1 河童×1 <br/>三回合妖刀姬×1 大天狗×1 青行灯×1 <br/>",
			"妖刀·九式 <br/>一回合天邪鬼青×3 九命猫×1 <br/>二回合狸猫×3 鲤鱼精×1 河童×1 <br/>三回合妖刀姬×1 大天狗×1 青行灯×1 童男×2 <br/>",
			"妖刀·十式 <br/>一回合天邪鬼青×2 九命猫×2 <br/>二回合狸猫×3 河童×1 椒图×1 鲤鱼精×1 <br/>三回合妖刀姬×1 妖狐×2 桃花妖×1 大天狗×1 青行灯×1 <br/>"]
}
var hetongPF = {
	name : "河畔童谣",
	ghost :["第一层 <br/>一回合盗墓小鬼×1 提灯小僧×3 <br/>二回合童女×1 童男×3 <br/>三回合河童×1 奉为达摩×1 招福达摩×1 大吉达摩×1 御行达摩×1 <br/>",
			"第二层 <br/>一回合盗墓小鬼×1 提灯小僧×3 <br/>二回合独眼小僧×1 山童×3 <br/>三回合河童×1 白童子×1 黑童子×1 座敷童子×1 <br/>",
			"第三层 <br/>一回合惠比寿×1 武士之灵×3 <br/>二回合烟烟罗×1 食发鬼×3 <br/>三回合河童×1 灯笼鬼×2 赤舌×1 <br/>",
			"第四层 <br/>一回合廉鼬×1 黑豹×3 <br/>二回合萤草×1 觉×3 <br/>三回合河童×1 丑时之女×2 兵俑×1 <br/>",
			"第五层 <br/>一回合天邪鬼黄×1 蝴蝶精×2 鬼女红叶×1 <br/>二回合孟婆×1 妖琴师×2 山兔×1 <br/>三回合河童×1 樱花妖×1 桃花妖×1 凤凰火×1 <br/>",
			"第六层 <br/>一回合鬼使白×1 鬼使黑×3 <br/>二回合座敷童子×1 古笼火×3 <br/>三回合河童×1 天邪鬼青×1 天邪鬼赤×1 天邪鬼绿×1 天邪鬼黄×1 <br/>",
			"第七层 <br/>一回合青灯行×1 管狐×3 <br/>二回合茨木童子×1 首无×3 <br/>三回合河童×1 雨女×1 判官×1 食梦貘×1 <br/>",
			"第八层 <br/>一回合海坊主×1 青坊主×3 <br/>二回合荒川之主×1 吸血姬×2 椒图×1 鲤鱼精×1 <br/>三回合河童×1 海坊主×2 椒图×1 鲤鱼精×1 荒川之主×1 <br/>",
			"第九层 <br/>一回合雨女×1 青蛙瓷器×3 <br/>二回合妖狐×1 妖刀姬×1 鲤鱼精×1 跳跳妹妹×1 萤草×1 <br/>三回合河童×1 鸦天狗×2 阎摩×1 鲤鱼精×1 大天狗×1 <br/>",
			"第十层 <br/>一回合兵俑×1 萤草×3 <br/>二回合跳跳弟弟×1 小鹿男×2 桃花妖×2 椒图×1 <br/>三回合河童×1 樱花妖×1 鲤鱼精×1 椒图×1 妖狐×1 花鸟卷×1 <br/>"]
}
var yunvPF = {
	name:"雨女的等候",
	ghost:[ "第一层 <br/>一回合唐纸伞妖×1 盗墓小鬼×3 <br/>二回合九命猫×3 铁鼠×1 <br/>三回合座敷童子×3 雨女×1 <br/>",
			"第二层 <br/>一回合唐纸伞妖×1 盗墓小鬼×3 <br/>二回合九命猫×3 铁鼠×1 <br/>三回合首无×3 雨女×1 <br/>",
			"第三层 <br/>一回合唐纸伞妖×1 盗墓小鬼×3 <br/>二回合九命猫×3 铁鼠×1 <br/>三回合武士之灵×3 雨女×1 <br/>",
			"第四层 <br/>一回合赤舌×1 唐纸伞妖×3 <br/>二回合丑时之女×1 觉×3 <br/>三回合骨女×4 雨女×1 <br/>",
			"第五层 <br/>一回合赤舌×1 唐纸伞妖×3 <br/>二回合丑时之女×1 觉×3 <br/>三回合烟烟罗×4 雨女×1 <br/>",
			"第六层 <br/>一回合赤舌×1 唐纸伞妖×3 <br/>二回合丑时之女×1 觉×3 <br/>三回合夜叉×4 雨女×1 <br/>",
			"第七层 <br/>一回合巫蛊师×1 鸦天狗×3 <br/>二回合三尾狐×1 萤草×2 蝴蝶精×1 <br/>三回合兵俑×4 雨女×1 <br/>",
			"第八层 <br/>一回合巫蛊师×1 鸦天狗×3 <br/>二回合跳跳弟弟×4 蝴蝶精×1 <br/>三回合河童×5 雨女×1 <br/>",
			"第九层 <br/>一回合巫蛊师×1 鸦天狗×3 <br/>二回合鬼使白×2 清姬×2 判官×1 <br/>三回合管狐×5 雨女×1 <br/>",
			"第十层 <br/>一回合巫蛊师×1 鸦天狗×3 <br/>二回合吸血姬×5 童男×1 <br/>三回合青蛙瓷器×5 雨女×1 <br/>"]
}
var huangchuanPF = {
	name : "荒川之怒",
	ghost : [	"第一层 <br/>一回合赤舌×1 灯笼鬼×3 <br/>二回合武士之灵×1 寄生魂×3 <br/>三回合盗墓小鬼×3 荒川之主×1 <br/>",
				"第二层 <br/>一回合赤舌×1 灯笼鬼×3 <br/>二回合武士之灵×1 寄生魂×3 <br/>三回合童女×3 荒川之主×1 <br/>",
				"第三层 <br/>一回合赤舌×1 灯笼鬼×3 <br/>二回合武士之灵×1 寄生魂×3 <br/>三回合管狐×3 荒川之主×1 <br/>",
				"第四层 <br/>一回合鲤鱼精×1 河童×3 <br/>二回合海坊主×1 蝴蝶精×3 <br/>三回合鸦天狗×4 荒川之主×1 <br/>",
				"第五层 <br/>一回合鲤鱼精×1 河童×3 <br/>二回合海坊主×1 蝴蝶精×3 <br/>三回合山兔×4 荒川之主×1 <br/>",
				"第六层 <br/>一回合鲤鱼精×1 河童×3 <br/>二回合海坊主×1 蝴蝶精×3 <br/>三回合雪女×4 荒川之主×1 <br/>",
				"第七层 <br/>一回合金鱼姬×1 古笼火×3 <br/>二回合椒图×1 夜叉×4 <br/>三回合清姬×4 荒川之主×1 <br/>",
				"第八层 <br/>一回合金鱼姬×1 古笼火×3 <br/>二回合惠比寿×1 夜叉×4 <br/>三回合海坊主×5 荒川之主×1 <br/>",
				"第九层 <br/>一回合金鱼姬×1 古笼火×4 <br/>二回合荒川之主×1 夜叉×2 烟烟罗×4 <br/>三回合石距×1 <br/>",
				"第十层 <br/>一回合金鱼姬×1 古笼火×5 <br/>二回合大天狗 夜叉×4 <br/>三回合桃花妖×1 青行灯×1 姑获鸟×1 惠比寿×1 荒川之主×1 <br/>"]
}

//------------------------- 神秘线索 --------------------
var changeName = {
	"童女":"翅膀 羽衣 幼女",
	"山童":"单眼 石锤 怪力",
	"妖狐":"纸扇 书生 面具",
	"镰鼬":"锤子 钉耙 剑",
	"凃壁":"石 青苔 石墙",
	"河童":"水球 河流 水池 荷叶",
	"孟婆":"汤碗 琴 牙牙",
	"犬神":"剑 雀 屋 守护 柴犬",
	"椒图":"贝壳 扇子 尾巴 水",
	"阎魔":"云 鬼面 冥界",
	"童男":"翅膀 羽衣 献祭",
	"兵俑":"剑 坚甲 石化",	
	"雨女":"泪珠 雨 伞",
	"骨女":"骷髅 怨念 剑",	
	"萤草":"蒲公英 治疗 叮",
	"鲤鱼精":"水池 水泡 尾巴",
	"三尾狐":"樱花树 红色 妖艳 红尾",
	"鬼使黑":"黑镰 短刀",
	"桃花妖":"花 舞",
	"海坊主":"渔夫/海/胡须/杖",
	"傀儡师":"人偶 操纵",
	"食梦貘":"铃铛 噩梦",
	"鸦天狗":"雉刀 翅膀 面具",
	"蝴蝶精":"手鼓 小妖精 可爱",
	"大天狗":"大翅膀 风 扇 羽毛 笛子",
	"鬼使白":"冥界 白 夺命",
	"吸血姬":"血 蝙蝠",
	"巫蛊师":"蛊 虫子",
	"独眼小僧":"单眼 石菩萨 金刚经",
	"座敷童子":"鬼火 角 财富/幸运",
	"天邪鬼黄":"鼓 单眼",
	"天邪鬼青":"青皮肤 风筝",
	"青蛙瓷器":"二筒 瓷 出千",
	"丑时之女":"稻草人 咒锥",
	"天邪鬼赤":"红鬼 拍屁股",
	"跳跳哥哥":"蜡烛 棺材",
}




// 存放所有章节
var chapterList = [chapter1,chapter2,chapter3,chapter4,chapter5,chapter6,chapter7,chapter8,chapter9,chapter10,chapter11,chapter12,chapter13,chapter14,chapter15,chapter16,chapter17,chapter18,chapter19,chapter20,chapter21,
				   yuhun1,yuhun2,yuhun3,yuhun4,yuhun5,yuhun6,yuhun7,yuhun8,yuhun9,yuhun10,
				   ttggB,jtB,gnB,egB,eknB,hfzB,gshB,tsB,jydmB,yyhB,
				   gnhyPF,yaodaoPF,hetongPF,yunvPF,huangchuanPF
				   
];

/* function searchGhost(name){
	var listTemp = new Array();	// 存放找到的结果
	for(var i=0; i<chapterList.length; i++){
		var info = "";
		// 查找某个章节
		for(var j=0; j<chapterList[i].ghost.length; j++){
			if(chapterList[i].ghost[j].indexOf(name)>0){
				info += chapterList[i].ghost[j] + "<br/>" + "<br/>";
			}
		}
		// 结束某个章节的查找
		if(info != ""){
			info = chapterList[i].name + "<br/>" + "<br/>" + info;
			listTemp[listTemp.length] = info
		}
	}
	
	return listTemp;
} */

